{
   "Output" : {
      "File" : {
         "_CSV" : "Boolean to determine if CSV files should be created with the data that gets put into the email.",
         "CSV" : true,
         "_JSON" : "Boolean to determine if JSON files should be created with the data that gets put into the email.",
         "JSON" : true,
         "_XML" : "Boolean to determine if XML files should be created with the data that gets put into the email.",
         "XML" : true,
         "_Zips" : "A global on/off switch to determine if the zip files should be downloaded for the Triage ENFs.",
         "Zips" : false,
         "_Suffix" : "This is the suffix that will be added to the end of the CSV/JSON/XML files created using this config file.",
         "Suffix" : "Allstate-DailyBuilds",
         "_AppendDate" : "Boolean to determine if a datetime stamp should be added to the folder, in which, the files are saved to, if they are to be saved.",
         "AppendDate" : true,
         "_Save" : "Boolean to determine if the CSV/JSON/XML files should be saved to the local disk or if they should be deleted after they have been sent in the email.",
         "Save" : true
      },
      "_Email" : "This is the config for the email settings.",
      "Email" : {
         "_Subject" : "This is the subject of the email that will be sent out.  This is static and has no escape characters.",
         "Subject" : "ENF Automated Alerts Email",
         "_Recipient" : "This is a hard coded list of recipients for the email.",
         "Recipient" : [
         ],
         "_RecipientsScheduled" : "This is the way to dynamically add recipients to an email based on a start/end date pair or a service pack.",
         "RecipientsScheduled" : [
            {
               "_Name" : "The name of the person.",
               "Name" : "John Smith",
               "_Email" : "The email of the person.",
               "Email" : "John.Smith@insurity.com",
               "_ServicePack" : "Array of service packs that the person should be added to the email. Service packs are counted from Monday to the Friday two weeks ahead.",
               "ServicePack" : [
                  "XX.XX"
               ],
               "_Dates" : "If not using the service pack, the dates array holds the start and end dates.",
               "Dates" : [
                  {
                     "_StartDate" : "The start date of when the user should be added as a recipient.",
                     "StartDate" : "",
                     "_EndDate" : "The end date of when the user should be added as a recipient.",
                     "EndDate" : "",
                     "_TimeSpan" : "Timespan that the user should be added as a recipient. Use either this or end date. End date has priority.",
                     "TimeSpan" : ""
                  }
               ]
            }
         ],
         "_CC" : "This is a hard coded list of carbon copy recipients for the email.",
         "CC" : [
         ],
         "_Attachment" : "Should the CSV,XML,JSON files be attached to the email.",
         "Attachment" : true,
         "_Priority" : "What should the priority of the email be. High, Normal, or Low.",
         "Priority" : "High"
      }
   },
   "_BaseDir" : "This is where all the local files are created and store, if the setting says so.",
   "BaseDir" : "C:\\ENF",
   "_ENFSets" : "This is the list of ENFsets that the script should check against.",
   "ENFSets" : [
      {
         "_Name" : "This is the name of the set that will be used by the script.",
         "Name" : "All",
         "_TimeSpan" : "This is how long the script should look back for the ENFs in this set. THe format for this is m/\d+[mhd]/ meaning a number followed by 'm' for minutes, 'h' for hours, and 'd' for days.",
         "TimeSpan" : "2h",
         "_Zips" : "This is how many zips should be downloaded for the set if the setting above says to download the zips. This may become depricated. The format for this is m/\d+[fl]/ meaning a number followed by either 'f' for first or 'l' for latest zips.",
         "Zips" : "5l",
         "_MinCount" : "This is the number of occurrence ENFs that should occur before the script will count it in the numbers or email.",
         "MinCount" : 1,
         "_Email" : "These are the email settings for the ENF set. They determine how the ENF displays on the email.",
         "Email" : {
            "_Threshold" : "Threshold of how many occurrence need to occur in the set for it to be added to the email. '0' means always send an email.",
            "Threshold" : "1",
            "_Details" : "Should the details section be shown for the ENFs in this set. Contains useful information, but adds bulk to the email.  This controls the whether the rest of the settings in Email matter or not.",
            "Details" : true,
            "_Stack" : "Should the stack be shown in the email section. Can make the email very bulky.", 
            "Stack" : true,
            "_OrderBy" : "This is the setting to show what order the details section of the email should be ordered by. The valid entries are 'date' to order by date or 'count' to order by count.",
            "OrderBy" : "date",
            "_IncludeNotes" : "Should the notes on the ENF be shown in the email. These are the notes that are added to the ENF in the ENF tool.",
            "IncludeNotes" : true,
            "_IncludeEmptyNotes" : "Should there be an empty section for the recipients to add their notes to. This may be depricated.",
            "IncludeEmptyNotes" : false,
            "_IncludeLatestInfo" : "Should there be information in the details section for the latest occurrence.",
            "IncludeLatestInfo" : true
         },
         "_ExMsgs" : "List of exception messages that should be looked at by the script for this set.",
         "ExMsgs" : [
            "%"
         ],
         "_NotExMsgs" : "List of exception messages that should not be included in the ENF searches for this ENF set.",
         "NotExMsgs" : [
         ]
      }
   ],
   "ENFPortfolio" : "This is the portfolio that the script should narrow the search to. Used for Daily Builds LOB teams.",
   "ENFPortfolio" : [
   ],
   "_ENFSkippedPortfolio" : "This is the set of portfolios that the script should skip when running its search. Used for Daily Builds LOB teams.",
   "ENFSkippedPortfolio" : [
   ],
   "_ENFLobs" : "This is the set of LOBs that the script will narrow its search to. They should be the two character codes that are used in-house.",
   "ENFLobs" : [
   ],
   "_ENFSkippedStatuses" : "This is the list of status of an ENF that should be skipped when getting the list of ENFs.",
   "ENFSkippedStatuses" : [
      "Deferred",
      "Environmental",
      "In Progress",
      "Resolved"
   ],
   "_Envs" : "This is the environments that should be looked at for each ENFSet.",
   "Envs" : [
      {
         "_Client" : "This is the client of the environment. The spelling and correct values is determined by the environmental config file.",
         "Client" : "DailyBuilds",
         "_Env" : "This is the environment within the client. The spelling and correct values are determined by the environmental config file.",
         "Env" : "Prod"
      }, {
         "Client" : "Allstate",
         "Env" : "Prod"
      }, {
         "Client" : "Allstate",
         "Env" : "QA"
      }
   ]
}

